export const quiz = {
    topic: 'Javascript',
    level: 'Beginner',
    totalQuestions: 4,
    perQuestionScore: 5,
    questions: [
      {
        question: 'چه کسی در فینال جام جهانی 2014 جایزه بهترین بازیکن مسابقه را برد؟',
        choices: ['ماریو گوتزه', 'سرخیو آگوئرو', 'لیونل مسی', 'باستین شواین اشتایگر'],
        type: 'جام جهانی',
        correctAnswer: 'ماریو گوتزه',
      },
      {
        question: 'بعد از از دست دادن یک بازیکن کلیدی در بازی اول، کدام تیم به نیمه نهایی یورو 2020 راه یافت؟',
        choices: ['دانمارک', 'اسپانیا', 'ولز', 'انگلستان'],
        type: 'یورو',
        correctAnswer: 'دانمارک',
      },
      {
        question:
          'رکورد بیشترین تعداد پاس گل در لیگ برتر کدام بازیکن است؟',
        choices: ['سسک فابرگاس', 'رایان گیگز', 'فرانک لمپارد', 'پل اسکولز'],
        type: 'لیگ برتر',
        correctAnswer: 'رایان گیگز',
      },
      {
        question: 'پورتو در فینال لیگ قهرمانان 2004 کدام تیم را شکست داد؟',
        choices: ['بایرن مونیخ', 'دپورتیوو لاکرونیا', 'بارسلونا', 'موناکو'],
        type: 'لیگ قهرمانان',
        correctAnswer: 'موناکو',
      },
    ],
  }